БухЭксп/Enums/CW_РеквизитыПутевыхЛистов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_РеквизитыПутевыхЛистов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Номер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прицеп</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыездФакт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвращениеФакт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТранспортноеСредство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтапыМаршрута_Водитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтапыМаршрута_АдресПогрузки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтапыМаршрута_АдресРазгрузки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтапыМаршрута_Груз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтапыМаршрута_ВесГруза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтапыМаршрута_ДатаПогрузки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтапыМаршрута_ДатаРазгрузки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтапыМаршрута_ДатаВыезда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтапыМаршрута_ДатаВозвращения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтапыМаршрута_Пробег</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтапыМаршрута_ПробегСГрузом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтапыМаршрута_ПробегПорожний</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Enums/CW_РеквизитыПутевыхЛистов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьТипыЗначенийРеквизитовПутевогоЛиста() Экспорт
	
	СоответствияТиповРеквизитов = Новый Соответствие;
	
	//РЕКВИЗИТЫ ШАПКИ
	СоответствияТиповРеквизитов.Вставить(Перечисления.CW_РеквизитыПутевыхЛистов.Дата					, Тип("Дата"));
	СоответствияТиповРеквизитов.Вставить(Перечисления.CW_РеквизитыПутевыхЛистов.Номер					, Тип("Строка"));
	СоответствияТиповРеквизитов.Вставить(Перечисления.CW_РеквизитыПутевыхЛистов.Прицеп					, Тип("СправочникСсылка.CW_ТранспортныеСредства"));
	СоответствияТиповРеквизитов.Вставить(Перечисления.CW_РеквизитыПутевыхЛистов.ВыездФакт				, Тип("Дата"));
	СоответствияТиповРеквизитов.Вставить(Перечисления.CW_РеквизитыПутевыхЛистов.ВозвращениеФакт			, Тип("Дата"));
	СоответствияТиповРеквизитов.Вставить(Перечисления.CW_РеквизитыПутевыхЛистов.ТранспортноеСредство	, Тип("СправочникСсылка.CW_ТранспортныеСредства"));
	
	//РЕКВИЗИТЫ ТАБЛИЧНОЙ ЧАСТИ
	СоответствияТиповРеквизитов.Вставить(Перечисления.CW_РеквизитыПутевыхЛистов.ЭтапыМаршрута_Водитель			, Тип("СправочникСсылка.ФизическиеЛица"));
	СоответствияТиповРеквизитов.Вставить(Перечисления.CW_РеквизитыПутевыхЛистов.ЭтапыМаршрута_АдресПогрузки		, Тип("Строка"));
	СоответствияТиповРеквизитов.Вставить(Перечисления.CW_РеквизитыПутевыхЛистов.ЭтапыМаршрута_АдресРазгрузки	, Тип("Строка"));
	СоответствияТиповРеквизитов.Вставить(Перечисления.CW_РеквизитыПутевыхЛистов.ЭтапыМаршрута_Груз				, Тип("СправочникСсылка.CW_Грузы"));
	СоответствияТиповРеквизитов.Вставить(Перечисления.CW_РеквизитыПутевыхЛистов.ЭтапыМаршрута_ВесГруза			, Тип("Число"));
	СоответствияТиповРеквизитов.Вставить(Перечисления.CW_РеквизитыПутевыхЛистов.ЭтапыМаршрута_ДатаПогрузки		, Тип("Дата"));
	СоответствияТиповРеквизитов.Вставить(Перечисления.CW_РеквизитыПутевыхЛистов.ЭтапыМаршрута_ДатаРазгрузки		, Тип("Дата"));
	СоответствияТиповРеквизитов.Вставить(Перечисления.CW_РеквизитыПутевыхЛистов.ЭтапыМаршрута_ДатаВыезда		, Тип("Дата"));
	СоответствияТиповРеквизитов.Вставить(Перечисления.CW_РеквизитыПутевыхЛистов.ЭтапыМаршрута_ДатаВозвращения	, Тип("Дата"));
	
	СоответствияТиповРеквизитов.Вставить(Перечисления.CW_РеквизитыПутевыхЛистов.ЭтапыМаршрута_Пробег			, Тип("Число"));
	СоответствияТиповРеквизитов.Вставить(Перечисления.CW_РеквизитыПутевыхЛистов.ЭтапыМаршрута_ПробегСГрузом		, Тип("Число"));
	СоответствияТиповРеквизитов.Вставить(Перечисления.CW_РеквизитыПутевыхЛистов.ЭтапыМаршрута_ПробегПорожний	, Тип("Число"));
	
	Возврат СоответствияТиповРеквизитов;
	
КонецФункции

#КонецЕсли
